Обработки/Reports/_ОтчетОДоходахИРасходахФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОДоходахИРасходахФЛ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОДоходахИРасходахФЛ/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет, "Сводный налоговый регистр для физических лиц", "0.06", "", Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
//	Настройки.Добавить("ВариантОтчета");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Возврат Настройки;

КонецФункции

Функция ПреобразоватьИмя(вхСтрока)
	
	//П02010100
	//2.1.1
	
	Ч1 = СтрЗаменить(Сред(вхСтрока,2,2), "0", "");
	Ч2 = СтрЗаменить(Сред(вхСтрока,4,2), "0", "");
	Ч3 = СтрЗаменить(Сред(вхСтрока,6,2), "0", "");
	Ч4 = СтрЗаменить(Сред(вхСтрока,8,2), "0", "");
	
	Ч4 = ?(ПустаяСтрока(Ч4), "", "."+Ч4);
	Ч3 = ?(ПустаяСтрока(Ч3), "", "."+Ч3);
	Ч2 = ?(ПустаяСтрока(Ч2), "", "."+Ч2);
	
	Возврат Ч1+Ч2+Ч3+Ч4;
	
	
КонецФункции

Процедура Сформировать(ДокументРезультат, ДокументРасшифровка) Экспорт 
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления,Подписант");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();
	
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ДокументРезультат.Очистить();
	ДокументРасшифровка.Очистить();
	
	Результат = Документы.РасчетНДФЛ.Расчет_НДФЛ(Организация, СчетДоверительногоУправления, КонецДня(Период), Истина);	
	
	ДокументРезультат = Результат.ДокументРезультат;	
	
	//шапка прищла из документа
	
	//Подписи	
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Подразделение", ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
	СтруктураКлюча.Вставить("Язык", ПредопределенноеЗначение("Справочник.Языки.Русский"));
	СтруктураКлюча.Вставить("Объект", ЭтотОбъект.Организация);
	СтруктураКлюча.Вставить("КонтактноеЛицо", ЭтотОбъект.Подписант);
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча);
	
	ПараметрыВыводаПодписей = Новый Структура;
	ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);	
	КонецЕсли; 
	
	РаботаСОтчетами.ВывестиПодписи(ДокументРезультат, ПараметрыВыводаПодписей);		
	
	//Расшифровка
	ОбщиеФункции = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ОтчетыДоходыРасходыОбщиеФункции");	
	ОбщиеФункции.ПечатьРасшифровки(ПолучитьМакет("Расшифровка"), ДокументРасшифровка, Результат.ТабРасшифровки);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);

КонецПроцедуры
